const input = document.querySelector('.input');
const letters = Array.from(document.querySelectorAll('[data-letters]'));
const specs = Array.from(document.querySelectorAll('[data-spec]'));
const textExample = document.querySelector('#textExample');

const text = `Якуты являются коренным населением Республики Якутия и самым крупным из всех коренных народов Сибири. О предках якутов было впервые упомянуто в 14 веке. Предки современных якутов - кочевое племя курыканов, которые до XIVвека жили на территории Забайкалья. Пришли они туда из-за реки Енисей. Якуты делятся на несколько основных групп:
- амгинско-ленские, проживают между рекой Леной, на прилегающем левобережье реки, между нижним Алданом и Амгой;
- олёкминские, заселяют территории в бассейне Олёкмы;
- вилюйские, живут в бассейне Вилюя;
- северные, проживают в тундровой зоне бассейнов рек Колыма, Оленёк, Анабар, Индигирка и Яна.
Самоназвание народа звучит как саха, во множественном числе сахалар. Есть и старинное самоназвание уранхай, которое еще пишется ураанхай и ураангхай. Эти названия и сегодня используются в торжественных речах, песнях и олонхо. Есть среди якутов сахаляры — метисы, потомки смешанных браков между якутами и представителями европеоидной расы. Это слово нельзя путать с вышеупомянутым сахалар.

Где живут
Основная часть якутов проживает в Якутии, на территории России, некоторая часть живет в Магаданской, Иркутской областях, Красноярском и Хабаровском краях, в Москве, Бурятии, Санкт-Петербурге и на Камчатке.

Численность
На 2018 год численность населения республики Якутия составляет 964 330 человек. Почти половина всей численности приходится на центральную часть Якутии.

Язык
Якутский на ряду с русским является одним из государственных языков Республики Якутии. Якутский относится к тюркской группе языков, но значительно отличается от них лексикой неясного происхождения, которая, возможно, относится к палеоазиатской. В якутском много слов монгольского происхождения, древних заимствований и русских слов, которые появились в языке после того, как Якутия вошла в состав России.

Используется якутский язык в основном в быту якутов и их общественной жизни. Владеют этим языком эвенки, эвены, долганы, юкагиры, русское старожильческое население: ленские крестьяне, якутяне, походчане и русскоустьинцы. Используют этот язык на территории Якутии в делопроизводстве, на нем проводятся мероприятия культурно-массового характера, издаются газеты, журналы, книги, ведется радиовещание и телевизионные программы, есть интернет-ресурсы на якутском языке. В городе и сельских местностях на нем ставят постановки. Якутский является языком древнего эпоса олонхо.

Распространено среди якутов двуязычие, 65% свободно говорят на русском. В якутском языке существует несколько групп диалектов:

Северо-Западная
Вилюйская
Центральная
Таймырская
В якутском языке сегодня используется алфавит на основе кириллицы, в нем есть все русские буквы и еще 5 дополнительных, а также 2 комбинации Дь дь и Нь нь, применяется 4 дифтонга. Долгие гласные звуки на письме обозначаются удвоенными гласными буквами.


Характер
Якуты очень трудолюбивые, выносливые, организованные и упорные люди, обладают хорошей способностью приспосабливаться к новым условиям жизни, переносить трудности, невзгоды и голод.

Внешность
У якутов чистой расы овальная форма лица, широкий и гладкий, невысокий лоб, черные глаза с чуть скошенными веками. Нос прямой, часто с горбинкой, рот большой, зубы крупные, скулы умеренные. Цвет лица смуглый, бронзовый или изжелта-серый. Волосы прямые и жесткие, черного цвета.

Одежда
В национальном костюме якутов сочетаются традиции разных народов, он отлично приспособлен для сурового климата, в котором живет этот народ. Это отражается в крое и оформлении одежды. Состоит костюм из кафтана с поясом, кожаных штанов и меховых носков. Рубахи якуты подпоясывают ремешком. Зимой носят сапоги из оленьей кожи и меха.

Главный орнамент одежды, это цветок лилии-санданы. В одежде якуты стараются сочетать все цвета года. Черный — это символ земли и весны, зеленый — лето, коричневый и красный — осень, серебряные украшения символизируют снег, звезды и зиму. Якутские узоры всегда состоят из разветвленных непрерывных линий, которые означают, что род не должен прекращаться. Чем больше у такой линии ответвлений, тем больше детей у человека, которому принадлежит одежда.


В пошиве верхней одежды использован разношерстный мех, жаккардовый шелк, сукно, кожа и ровдуга. Украшается костюм бисером, орнаментными вставками, металлическими подвесками и украшениями.

Бедняки шили нательную и летнюю одежду из тонкой замшевой кожи, богатые носили рубахи из китайской хлопчатобумажной ткани, которая была дорогой и получить ее можно было только путем натурального обмена.

Праздничная одежда якутов более сложного кроя. Стан к низу расширен, у рукавов сборка по окату. Называются такие рукава бууктаах. Облегченные кафтаны имели ассиметричную застежку, щедро декорировались бисерной вышивкой, узкой полоской дорогого меха и металлическими элементами. Носили такую одежду только зажиточные.

Одним из предметов гардероба якутов являются халатообразные изделия, пошитые из ткани дабы с цельнокроеными рукавами. Носили ее женщины в летний период. Шапка якутов похожа на камелек. На верхушке обычно делали отверстие для того, чтоб туда заглядывали луна и солнце. Ушки на шапке означают связь с космосом. Сегодня их принято украшать бисером.


Религия
До того, как Якутия вступила в состав России, народ исповедовал религию Аар Айыы, которая предполагала веру в то, что все якуты являются детьми Танара — бога и родственника 12 Белых Айыы. Они верили, что ребенок еще с момента зачатия окружен духами иччи и небожителями, верили в злых и добрых духов, духов-хозяев и духов умерших шаманов. У каждого рода было животное-покровитель, которого нельзя было называть по имени и убивать.

Якуты верили, что мир состоит из нескольких ярусов, в верхнем главой является Юрюнг Айыы Тойон, в нижнем — Ала Буура Тойон. Духам, которые живут в верхнем мире, в жертву приносили лошадей, тем, кто живет в нижнем мире — коров. Важное место занимал культ женского божества плодородия Айыысыт.

В 18 веке в Якутию пришло христианство, и большая часть коренного населения стала православными христианами. Но массовая христианизация в большинстве была формальной, якуты нередко принимали ее из-за льгот, которые им полагались взамен, и долгое время поверхностно относились к этой религии. Сегодня большинство якутов являются христианами, но распространена и традиционная вера, пантеизм, агностицизм. До сих пор в Якутии есть шаманы, правда, их крайне мало.


Жилище
Якуты жили в урасах и бревенчатых балаганах, которые еще назывались якутскими юртами. С 20 века начали строить избы. Поселения якутов состояло из нескольких юрт, которые располагались друг от друга на большом расстоянии.

Юрты строились из стоячих круглых бревен. Для строительства использовались только мелкие деревья, рубка больших является грехом. Место для постройки должно быть расположено низко и защищено от ветра. Якуты всегда ищут «счастливое место» и не селятся среди больших деревьев, так как считают, что они уже взяли из земли всю силу. При выборе места для строительства юрты якуты обращались к шаману. Часто жилища строились разборными, чтобы было легко их перевозить при кочевом образе жизни.

Двери в жилище расположены с восточной стороны, навстречу солнцу. Крышу покрывали берестой, для освещения в юрте делали много маленьких окон. Внутри расположен камин, обмазанный глиной, вдоль стен стояли широкие лежаки разной формы, отделенные друг от друга перегородками. У входа расположен самый низкий. На высоком лежаке спит хозяин жилища.


Жизнь
Основными занятиями якутов было коневодство и скотоводство. Мужчины смотрели за лошадьми, женщины — за крупным рогатым скотом. Проживающие на севере якуты разводили оленей. Якутский скот был малопродуктивен, но очень выносливый. Издавна среди якутов было известно сенокошение, еще до прихода русских развито было и рыболовство. Рыбу ловили в основном летом, зимой во льду делали проруби. В осенний период якуты устраивали коллективную неводьбу, добыча делилась между всеми участниками. Бедняки, у которых скота не было, кормились в основном рыбой. Специализировались на этой деятельности и пешие якуты: кокулы, онтуи, осекуи, орготы, крикийцы и кыргыдайцы.

Охота особенно была распространена на севере и являлась в этих регионах основным источником пропитания. Охотились якуты на зайца, песца, птицу, лося и северного оленя. С приходом русских в тайге стала распространяться пушная и мясная охота на медведя, белку, лисицу, но позже, из-за снижения численности зверей, стала уже не так популярна. Якуты охотились с быком, за которого прятались, подкрадываясь к добыче. По следу зверей гонялись на конях, иногда с собаками.


Занимались якуты и собирательством, собирали внутренний слой коры лиственницы и сосны, сушили на зиму. Собирали коренья чекана и сарана, зелень: лук, щавель и хрен, занимались сбором ягод, но не употребляли малину, так как считали ее нечистой.

Земледелие якуты заимствовали у русских в 17 веке, и до 19 века это направление хозяйства было развито очень слабо. Выращивали ячмень, редко пшеницу. Широкому распространению земледелия среди этого народа, особенно в Олёмкинском округе, способствовали ссыльные русские поселенцы.

Хорошо развита была обработка дерева, якуты занимались художественной резьбой, раскрашивали изделия отваром из ольхи. Обрабатывали также бересту, кожу и меха. Из кожи производили посуду, из шкур коров и лошадей — коврики, из меха зайца шили одеяла. Конский волос использовали в шитье, плетении и вышивке, ссучивали руками в шнуры. Якуты занимались лепной керамикой, что выделяло их среди других сибирских народов. Была развита в народе плавка и ковка железа, плавка и чеканка серебра, меди и других металлов. С 19 века якуты начали заниматься резьбой по кости.

Передвигались якуты в основном верхом, а грузы перевозили вьюками. Делали лыжи, которые подбивали конским камусом, и сани, в которые запрягали быков и оленей. Для передвижения по воде мастерили берестяные лодки под названием тыы, делали плоскодонные доски, парусные суда-карбасы, которые заимствовали у русских.

В древности коренные народы, проживавшие на севере Якутии, вывели породу собак якутская лайка. Распространена и порода крупных придворовых якутских собак, которая отличается неприхотливостью.

Коновязей у якутов очень много, с древних времен они являются основными составляющими народа, с ними связаны традиции, обычаи, верования и обряды. Все коновязи имеют различную высоту, форму, украшения и орнаменты. Существует 3 группы таких конструкций:

надворная, в нее входят те коновязи, которые устанавливают у жилища. К ним коней привязывают;
столбы для проведения религиозных обрядов;
коновязи, устанавливаемые на главном празднике Ысыах.
Еда

Национальная кухня якутов немного схожа с кухней монголов, бурятов, северных народов и русских. Блюда готовят методом отваривания, сбраживания и заморозки. Из мяса якуты употребляют в пищу конину, оленину и говядину, дичь, кровь и потроха. Широко распространено в кухне этого народа приготовление блюд из сибирской рыбы: чира, осетра, омуля, муксуна, пеляди, хариуса, нельмы и таймени.

Якуты максимально используют все компоненты исходного продукта. Например, при приготовлении карасей по-якутски рыба остается с головой и практически не потрошится. Чешую счищают, через небольшой надрез удаляют желчный пузырь, часть толстой кишки и прокалывают плавательный пузырь. Рыбу жарят или варят.

Все субпродукты используются довольно активно, очень популярен суп из потрошков, кровяные деликатесы, конский и говяжий ливер, который заполняется смесью из крови и молока. Мясо с говяжьих и конских ребер называется в Якутии ойогос. Едят его замороженным или сырым. Из замороженной рыбы и мяса делают строганину, которую едят с острой приправой. Из лошадиной и говяжьей крови делают кровяную колбасу хаан.

В традиционной кухне якутов не используются овощи, грибы и фрукты, употребляются только некоторые ягоды. Из напитков употребляют кумыс и более крепкий койуургэн, вместо чая пьют горячий морс. Из молока коровы готовят простоквашу суорат, взбитые сливки керчэх, густой крем из сбитого с молоком масла, который называется кобер, чохоон — сбитое с ягодами молоком и масло, творог иэдьэгэй, сыр суумэх. Из смеси молочных продуктов и муки варят густую массу саламат. Из квашеного раствора ячменной или ржаной муки делают бурдук.


Фольклор
Древний эпос олонхо передается из поколения в поколение и похож в исполнении на оперу. Это древнейшее эпическое искусство якутов, которое занимает самое основное место в фольклоре народа. Олонхо обозначает эпическую традицию и служит названием отдельных сказаний. Поэмы длиной в 10 000-15 000 строк исполняются народными сказителями, которыми могут стать далеко не все. Сказитель должен обладать ораторским и актерским талантом, уметь импровизировать. На исполнение больших олонхо может уйти 7 ночей. Самое крупное такое произведение состоит из 36 000 стихотворных знаков. В 2005 году олонхо было объявлено ЮНЕСКО «шедевром нематериального и устного наследия человечества».

Народные певцы якутов используют тип горлового пения дьиэрэтии ырыа. Это необычная техника пения, артикуляция которой основана в гортани или глотке.

Самый известный из музыкальных инструментов якутов это хомус — якутская разновидность варгана и струнно-смычкового инструмента. Играют на нем губами и языком.


Традиции
Якуты всегда стремились жить в гармонии с собой, верой и природой, они чтут традиции и не боятся перемен. Традиций и обрядов у этого народа столько, что можно написать об этом отдельную книгу.

Якуты ограждают свои жилища и скот от злых духов, используя множество заговоров, проводят обряды для приплода скота, хорошего урожая и рождения детей.

Камень Сат у этого народа считается волшебным, женщинам на него смотреть нельзя, иначе он потеряет свою силу. Находят эти камни в желудках птиц и животных, заворачивают в бересту и заматывают конским волосом. Считается, что с помощью определенных заклинаний и этого камня можно вызвать снег, дождь и ветер.

Якуты являются очень гостеприимными людьми и любят дарить друг другу подарки. Родильные обряды у них связаны с богиней Айыысыт, которую считают покровительницей детей. Согласно мифам, Айыы принимает только жертвоприношения растительного происхождения и молочные продукты. В бытовом современном языке якутов есть слово «аньыы», смысл которого переводится как «нельзя».

В брак якуты вступают с 16 до 25 лет. До 19 века в Якутии было распространено многоженство, но жены при этом жили отдельно от мужа, и каждая вела свое хозяйство. Существовал калым, который состоял из скота. Часть калыма — курум предназначалась для свадебного празднества. За невестой было приданое, которое по своей ценности было равно половине калыма. В основном это была одежда и утварь. Современный калым заменили на деньги.

Обязательный традиционный обряд у якутов — это Благословение Айыы на торжествах и праздниках на природе. Благословения — это молитвы. Самым важным праздником является Ысыах, день восхваления Белых Айыы. При охоте и рыболовстве проводят обряд задабривания духа охоты и удачи Байанай.


С умершими проводили обряд воздушного погребения, подвешивали тело в воздухе. Обряд означал предание покойного свету, воздуху, духу и дереву.

Все якуты почитают деревья, считают, что в них живет дух хозяйки земли Аан Дархан Хотун. Когда восходили на горы, лесным духам традиционно приносили в жертву рыбу и животных.

Во время национального праздника Ысыах проводятся национальные якутские прыжки, международные игры «Дети Азии», которые делятся на следующие этапы:

Кылыы, 11 прыжков без остановки, начинается прыжок на одной ноге, приземляться надо на обе ноги;
Ыстанга, 11 прыжков по очереди с ноги на ногу. Приземляться нужно на обе ноги;
Куобах, 11 прыжков без остановки, во время прыжка с места нужно отталкиваться сразу двумя ногами или приземляться с разбега на обе ноги.
Национальным видом спорта у якутов является мас-рестлинг, в процессе которого соперник должен вырвать из рук соперника палку. Этот спорт был выведен в 2003 году. Еще один вид спорта хапсагай — очень древний вид борьбы у якутов.

Свадьба в Якутии — особенное явление. С рождением в семье девочки, родители, по священной древней традиции, ищут ей жениха и многие годы следят за его жизнью, манерами и поведением. Обычно мальчика выбирают из той семьи, где отцы отличаются крепким здоровьем, выносливостью и силой, хорошо умеют трудиться руками, строить юрты, добывают пропитание. Если отец мальчика не передаст ему все свои навыки, его перестают рассматривать в качестве жениха. У некоторых родителей получается быстро найти жениха для дочери, а у кого-то этот процесс занимает долгие годы.


Сватовство является одним из обычаев и традиций якутов. Родители в назначенный день уходят в дом предполагаемого жениха, а девушке нельзя выходить из дома. Родители беседуют с родителями парня, во всех красках описывают свою дочь и ее достоинства. Если родители парня не против свадьбы, обсуждается размер калыма. К свадьбе девушку готовит ее мать, готовит ей приданое, шьет наряды. Невеста выбирает время свадьбы.

Раньше свадебное платье шили только из натуральных материалов. Сегодня это необязательно, важно только, чтобы наряд был белоснежным и комплектовался тугим поясом. На невесте должны быть обереги для защиты новой семьи от болезней и зла.

Невеста и жених сидят в разных юртах, шаман, мать жениха или отец невесты окуривают их дымом, очищая от всего дурного. Только после этого жених с невестой встречаются, их объявляют мужем и женой, и начинается торжество с застольем, танцами и песнями. После замужества девушка должна ходить только с покрытой головой, ее волосы должен видеть только муж.


Источник: https://travelask.ru/articles/yakuty-trudolyubivyy-i-vynoslivyy-narod`
const party = createParty(text);

init();

function init() {
    input.addEventListener('keydown', keydownHandler);
    input.addEventListener('keyup', keyupHandler);

    viewUpdate();
}

function keydownHandler(event) {
    event.preventDefault();
    const letter = letters.find(element => element.dataset.letters.includes(event.key))

    if (letter) {
        letter.classList.add('pressed');
        press(event.key);
        return
    }
    let key = event.key.toLowerCase();

    if (key === ' ') {
        key = 'space';
        press(' ')
    }

    if (key == 'enter') {
        press('\n');
    }

    const ownSpecs = specs.filter(element => element.dataset.spec === key);

    if (ownSpecs.length) {
        ownSpecs.forEach((ownSpecs => ownSpecs.classList.add('pressed')));
        return;
    }

    console.warn('Неизвестный вид клавиши', event);
}
function keyupHandler(event) {
    event.preventDefault();
    const letter = letters.find(element => element.dataset.letters.includes(event.key))

    if (letter) {
        letter.classList.remove('pressed');
        return
    }
    let key = event.key.toLowerCase()

    if (key === ' ') {
        key = 'space';
    }

    const ownSpecs = specs.filter(element => element.dataset.spec === key);

    if (ownSpecs.length) {
        ownSpecs.forEach((ownSpecs => ownSpecs.classList.remove('pressed')));
        return;
    }
}

function createParty(text) {
    const party = {
        text,
        strings: [],
        maxStringLength: 70,
        maxShowString: 3,
        currentStringIndex: 0,
        currentPressedIndex: 0,
        errors: [],
    };

    party.text = party.text.replace(/\n/g, '\n ');
    const words = party.text.split(' ');
    let string = [];
    for (const word of words) {
        const newStringLength =
            [...string, word].join(' ').length;// Я удалил + !word.includes('\n') потому что хер знает зачем оно

        if (newStringLength > party.maxStringLength) {
            party.strings.push(string.join(' ') + ' ')
            string = [];
        }

        string.push(word);

        if (word.includes('\n')) {
            party.strings.push(string.join(' '))
            string = [];
        }
    }

    // if (string.length) {
    //     party.strings.push(string.join(' ')); // тоже не понятно что делает этот код
    // }

    return party;
}

function press(letter) {
    const string = party.strings[party.currentStringIndex]
    const mustLetter = string[party.currentPressedIndex]

    if (letter === mustLetter) {
        party.currentPressedIndex++
        if (string.length <= party.currentPressedIndex) {
            party.currentPressedIndex = 0;
            party.currentStringIndex++;
        }
    }
    else if (!party.errors.includes(mustLetter)) {
        party.errors.push(mustLetter);
    }

    viewUpdate();
}

function viewUpdate() {
    const string = party.strings[party.currentStringIndex];

    const showedStrings = party.strings.slice(
        party.currentStringIndex,
        party.currentStringIndex + party.maxShowString
    );

    const div = document.createElement('div');

    const firstLine = document.createElement('div');
    firstLine.classList.add('line');
    div.append(firstLine);

    const done = document.createElement('span');
    done.classList.add('done');
    done.textContent = string.slice(0, party.currentPressedIndex);
    firstLine.append(
        done,
        ...string
            .slice(party.currentPressedIndex)
            .split('')
            .map((letter) => {
                if (letter === ' ') {
                    return '·';
                }

                if (letter === '\n') {
                    return '¶';
                }
                return letter;
            })
    )

    for (let i = 1; i < showedStrings.length; i++) {
        const line = document.createElement('div');
        line.classList.add('line');
        div.append(line);

        line.append(
            ...showedStrings[i]
                .split('')
                .map((letter) => {
                    if (letter === ' ') {
                        return '·';
                    }

                    if (letter === '\n') {
                        return '¶';
                    }

                    if (party.errors.includes(letter)) {
                        const errorSpan = document.createElement('span')
                        errorSpan.classList.add('hint');
                        errorSpan.textContent = letter;
                        return errorSpan;
                    }

                    return letter;
                })
        )
    }

    textExample.innerHTML = '';
    textExample.append(div);

    input.value = string.slice(0, party.currentPressedIndex);
}